Revit 2027 API
TabbedDialogExtension Constructor
Constructs a extension instance with a control and ok action handler.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TabbedDialogExtension(
	UserControl userControl,
	TabbedDialogAction onOK
)
Public Sub New (
	userControl As UserControl,
	onOK As TabbedDialogAction
)
public:
TabbedDialogExtension(
	UserControl^ userControl,
	TabbedDialogAction^ onOK
)
new :
        userControl : UserControl *
        onOK : TabbedDialogAction -> TabbedDialogExtension
Parameters
userControl UserControl
The control.
onOK TabbedDialogAction
The ok action handler.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when userControl or onOK is null.
ArgumentException | Thrown when userControl is already bound to another tabbed dialog.
See Also
Reference
TabbedDialogExtension Class
Autodesk.Revit.UI Namespace